# FilterStringRuleEvaluator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringRuleEvaluator Properties
FilterStringRuleEvaluator Class See Also
---
The FilterStringRuleEvaluator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FilterStringRuleEvaluator Class
Autodesk.Revit.DB Namespace